<template>
    <div id="index">
       <!-- <van-tabs >
            <van-tab v-for="(item,index) in title" :key="index" :title="item">
                <div style="padding: 1rem;text-indent:2rem;">
					{{main[index].text}}
                </div>
            </van-tab>
        </van-tabs> -->
		<van-tabs v-model="activeName">
		    <van-tab title="狗狗" name="a">
			    <p><img src="@/assets/img/dog2.jpg" alt=""  width="20%" align="left"/>
			    	幼龄时期是狗狗生长发育的主要阶段，身体增长迅速，因而必须供给充足的营养。一般出生后面三个月主要增长躯体和体重，4-6个月主要是增加体长，7个月后主要长体高。因此，应按不同的发育阶段，补充不同的营养。3个月内的幼犬每天最少喂4次，少添勤喂可以使狗狗总有不饱之感，不至于厌倦、挑食。4-6月龄的幼犬，食量增大体重增加很快，每天所需饲料量也随之增多，每天最少喂3次，6月后，每天喂2次即可。</p>
			    <i>只吃肉会出现疾病</i><br />
			    <img src="@/assets/img/dog1.jpg" alt=""  width="20%" align="right"/>
			    <p>有些家长认为，如给狗狗全部喂肉类，可以使狗狗长得健壮，其实这是错的做法。全吃肉类不只不能使狗狗健壮，反而因消化不良，难以吸收而使多数犬发生腹泻。肉类中蛋白质虽多，但维生素A、D、E和碘较少，同时肉类中钙少磷多，长期吃肉，易造成幼犬体内因钙、磷比例失调而骨骼形成障碍，易于断裂或出现跛行，对大型犬等更不宜过早喂以多量肉类，否则可能引起前肢弯曲。</p>
			    <i>狗狗离不开水</i><br />
			    <p>在养小狗时，水是必不可少的。一盆清水应始终放在一个固定的地方，以便在进食和运动前后自由饮用。幼犬的喂养应补充钙粉和维生素，这是牙齿和骨骼生长所必需的。每次户外运动应适当，紫外线照射后，容易吸收钙。在幼犬饲养管理中，应特别注意防止少数幼犬暴饮暴食。每天的食物消耗量应该由狗的大小决定。不宜过喂。百分之七十到八十是最好的。另外，由于幼犬胃肠道仍处于发育过程中，为了预防胃肠道疾病，应注意卫生。</p>
			    
		    </van-tab>
		    <van-tab title="猫咪" name="b">
			    <img src="@/assets/img/cat1.jpg" alt=""  width="30%" align="left"/>
			    <p>先要足够了解猫咪，猫咪是食肉动物，并且还是食肉动物中的纯肉食性动物，猫咪的胃液中只有能够消化肉类的酶，所以猫咪健康的饮食标准应该是以肉类为主的，谷物类成分对于猫咪来说是无法被消化利用，哪怕是吃下去了，最后也是被代谢出来，并且还会因为缺乏必要的成分而导致体质下降与毛发出现异常。</p>
			    <p>家里也可以给猫咪准备一些常见的植物，比如说大麦草、猫薄荷等等，因为喂食猫粮的猫咪自身对于代谢舔毛中被不慎吞入的毛球能力相对较弱，所以就需要这些植物作为辅助，然后将毛球给代谢或者呕吐出来。
			     <br />
			    <i>选择猫粮</i><br />
			    1. 天然粮：天然意味着新鲜，未加工过，未添加防腐剂、添加剂合成成分。<br />
			    2. 商品粮：价格实惠是最大优点，不过在食物本身各方面都不及天然粮。
			     <br />
			    <i>准备小道具</i><br />
				 <p>
			    1. 猫咪可以用胶带在猫咪攀爬这些地方的必经之路上贴上一圈胶带，这样猫咪的爪子就无法受力快速向上爬，它就会选择放弃。贴胶带的高度也得根据猫咪不同的体型来选择。<br />
			    2. 带着猫咪去到陌生环境，如果猫咪特别的害怕，那么主人可以在猫咪的爪子上涂上一点点营养膏，这样猫咪会在舔舐爪垫的过程中慢慢放松心情而达到适应环境的作用。<br />
			    3. 猫咪的猫窝中如果异味比较重，一方面是可以在太阳下暴晒一个小时以后放在阴凉通风处风干，另外可以在猫窝边用茶叶做一个小荷包便于吸收气味。
			     </p><br />
			    <i>猫咪生病表现不明显</i><br />
			    <p>猫咪是特别高傲的一种动物，它们不会在其他动物面前表现出自己的弱势，特别是在自己生病的时候，所以铲屎官需要从其他的细节出发去发现爱猫的一些小异常。猫咪排泄物带着大量水分不成型：猫咪肠道出现了问题，可以是寄生虫病或者是吞食异物后导致的肠胃炎等问题，需要及时检查问题并及早处理。
			     </p>
				 <br />
			    <i>猫咪生产需要陪伴</i><br />
			    <p>对于猫咪怀孕生小猫，其实这个时间只需要短短的一个半月，而猫咪怀孕期间铲屎官需要保证猫咪饮食中优质蛋白的供应量，如果一直喂食猫粮，猫咪生宝宝的时候奶水就不会特别充裕，适当提供优质食物对小猫的健康也会比较好。所以生产期间的护理和饮食都是很重要的。
			    </p>
		    </van-tab>
		    <van-tab title="兔子" name="c">
			    <img src="@/assets/img/rabbit1.jpg" alt=""  width="100%" />
			    			<p>首先你要把兔兔安放在一个阴凉干燥，避免阳光直射的，较安静的，没有太多干扰因素的地方。因为兔子是怕热喜凉的动物。适当的阳光是好的，但万不可曝晒，会把它晒死。如果无法避免阳光直射，把笼子的一半用布盖上就好。</p><br />
			    			<p>最好还是要有兔笼子，纸箱它会慢慢啃光，而且以它的弹跳能力，跳出来是不难的。实在没有兔笼可以找一个结实的够高的整理箱，只是会限制兔兔的视线范围。</p><br />			
			    			<p>你要把兔笼的底部铺满木屑。专门的宠物用木屑很便宜的，清洁卫生。木屑会吸水吸味，这样能限制兔子排泄物散发的臭味。兔子都喜欢在角落里上厕所，每天只要把角落里脏的木屑清干净就行了。实在没有的话铺满报纸也行，但报纸的吸水性不够好，兔子也会将其吃入肚中。</p><br />
			    			<p>其次是兔兔的饮食。兔子当然是可以喝水的，而且它是必须喝水的。但前提是它必须吃兔粮，因为仅仅是蔬菜加清水极容易引起腹泻死亡。没有饮水器就把水直接放在食盆里给它喝。但绝对没有饮水器方便，因为它会把碗里的水打泼或是弄得很脏，然后自己也不会去喝。新鲜蔬菜也能补充兔子的水分，但幼兔千万别给，很容易腹泻的。给的蔬菜一定要把表面的水分擦干。蔬菜并不能提供兔子所需的养分，所以兔兔必须吃兔粮和干草，偶尔搭配新鲜蔬菜。兔粮和干草一定要到宠物商店买，也是很便宜的。不要在外面随便抓草给它吃，有病菌很危险的。如果你还没有兔粮，请尽快购买。</p><br />
			       <img src="@/assets/img/rabbit2.jpg" alt=""  width="120px" align="right"/>
			    			<p>兔子是喜欢独居的动物，很害怕比它大的动物（人除外，真奇怪）和突如其来的巨大声响。如果你抚摸它，它会把身体伸得很长很长让你摸。如果它对食物不满意，它有可能用嘴把食盆掀翻，或者往食盆里尿尿。它要是生气了或者害怕了会跺脚，声音超大，有可能还会吓到你，但别担心，它只是在不爽。它高兴的时候会舔你的手指头，因为它喜欢舔咸咸的东西。但要小心别被它咬了。要准备一小块木头给它磨牙。</p>			
			    
		    </van-tab>
		    <van-tab title="鸟类" name="d">
			    <img src="@/assets/img/bird1.jpg" alt=""  width="30%" align="left"/>
			    <p>食罐和水罐：食、水罐是养鸟必备的器具，也是一种装饰。常见的有瓷罐、塑料罐、金属罐、竹罐等。除中、大型鹦鹉类的鸟用金属罐外，其他的鸟一般都用美观大方的瓷罐，鸟舍中多用结实耐用、不怕摔的塑料罐，以及大盆、盘或食槽、水槽等。
			    </p><br /><br /><i>巢箱：</i><br />
			    <p>用草绳编制。巢形主要有2种：一种是壶形巢，供文鸟类及营暗巢的小鸟使用；
			    另一种是碗形巢，供雀类等营开口巢的小鸟使用。此外，还有用三合板做的像小房子形状的
			    </p><i>筛子：</i><br />
			    <p>用以筛选散落笼底和食罐中吃剩的粒料。筛子有大眼和小眼两种，大眼筛子用于筛除鸟粪、垃圾、杂草和籽壳，小眼筛子主要是筛除泥沙。自制可在马口铁或铝皮上用钉打眼，或用铜纱布，外面加上木框即可。
			    </p><i>水壶：</i><br />
			    <p>专门用于向鸟笼的水罐中加水的用具。常用壶嘴细长的水壶，能伸进鸟笼到水罐口上，不会使水洒在笼内。可以用铁皮、铝皮等制作，也可以用旧塑料罐改制。在水壶上套上一个喷头，可以给鸟淋浴。小型鸟笼可用塑料眼药水瓶作加水器，还能吸出水罐内的污水
			    </p><i>栖杠：</i><br />
			    <p>也叫栖木，是鸟栖息的支架。最好的材料是天然去皮树根，其次是树支，以圆形略扁最适合鸟抓握。栖杠的粗细要根据鸟的体型大小来确定，太粗或太细都不适宜，以鸟爪抓握后，前后趾爪之间还有少量距离为宜。栖杠的表面要粗糙，便于鸟站立。如果用竹枝，需要在上面刻纹。有的栖杠上粘一层金刚沙，使鸟能研磨嘴和爪，这种栖杠多用于画眉、八哥笼内。大、中型的鸟笼可设置2根栖木，一高一低。有的设置可以晃动的浪木，可以使鸟增加活动量。
			    每天除了给观赏鸟供给合理搭配的日料和新鲜干净的饮水外，日常的管理在保持鸟的健康、正常生长发育和繁殖上也具有非常重要的意义，必须给予应有的重视。如若饲养管理不善，轻则将使鸟儿发病，重则可致导致鸟儿的死亡。每日应首先观察鸟的健康情况，看看活动、采食、饮水、粪便有无异常，如果发现异常情况，应立即多方寻找原因，及时采取措施。每天洗笼、洗罐后不要忘记添加饲料。有些带壳的饲料，经观赏鸟剥食后，籽壳留在食罐里，会出现仅有籽壳而无饲料的情况，所以要养成勤查食罐的习惯。
			    </p>
		    </van-tab>
		    <van-tab title="香猪" name="e">
			    <img src="@/assets/img/pig1.png" alt=""  width="100%" align="left"/>
			       <p>喂养小香猪的时候需要住在安静干燥的环境中，温度在25度左右最好，平时可以让它住在书房，或者是阳台都是可以的，宠物猪很怕冷，冬天的时候一定要记得给它准备一个温暖的窝，加些毛毯或者是被子，不要让它们着凉感冒或者是拉肚子，对小香猪的健康都是很不利的，如果小香猪出现了咳嗽，眼睛，鼻子流出粘液性分泌物，呼吸急促的话，要尽快把小香猪送到宠物医院就医，医生会根据小香猪的具体情况，控制小香猪的病情，带回家的时候也要仔细观察两天，千万不要自己私自买药给小香猪喂食，避免造成更大的伤害。</p>
			       <p>作为一只小香猪，当然是最喜欢吃了，而且还不挑食，平时就像人类一热三餐就好，主食用素食，比方说小黄花，胡萝卜等等，也可以适当的喂食一些鸡肉、牛肉给它补充一下蛋白质，但是喂食也要均衡喂养，以免平时摄入的卡路里过高，影响到小香猪的健康；平时也可以个小香猪喝一点牛奶补充钙质，网上虽然也有外国友人给小香猪喂喝啤酒的，但是小编建议，最好还是不要给小香猪喂食一些刺激性的食物比较好，想要训练一只好的小香猪就像平时训练猫猫狗狗差不多，前期用一个容器或者是一个盘子，接下排泄物就好，然后每天把这个物件往厕所的位置移动一段距离，直到小香猪知道去厕所排泄就可以了，过程可能会比较慢，一定要有耐心。</p>
			    
		    </van-tab>
		</van-tabs>
    </div>
</template>

<script>
    export default {
        name: "index",
        props: [''],
        data() {
            return {
				activeName: 'a',
                
            }
        },
        methods: {},
        mounted() {
        },
        created() {
        },
        components: {},
        watch: {},
    }
</script>

<style  lang='scss'>
    #index {
        margin-top: 2.5rem;
		
    }
	.van-tabs__line {
		background-color: #FF69B4 !important;
	}
	.van-tabs__content {
		padding: 0 0.5rem;
		font-size: 90% !important;
	}
	.van-tabs__content p {
		text-indent: 2em;
		margin: 0.2rem;
	}
	.van-tabs__content i {
		font-style: normal;
		color: #FF69B4;
	}
	.van-tabs__content img {
		margin: 0.1rem;
		box-sizing: border-box;
	}
</style>